#+TITLE: Indicadores de pobreza y desigualdad
#+SETUPFILE: ../setup.org



** La curva de Lorenz

La *curva de Lorenz* es una representación gráfica de la distribución
de la renta y muestra la proporción de renta que consigue el
porcentaje $p$ más pobre de la población, para $0\% \leq p \leq
100\%$.

Para una población con $N$ individuos ordenados de menor a mayor
renta, la curva de Lorenz, $L(p)$, asigna a cada proporción $p$ de
población la correspondiente renta total acumulada por esa fracción de
población. Siendo $y_{1} \le y_{2} \le \dots \le y_{N}$ las rentas de
los individuos ordenadas de menor a mayor, la curva de Lorenz se
define como:
#+begin_export latex
\[
L\big(k / N \big) =
\frac{\sum_{i = 1}^{k} y_{i}}{Y}, \qquad k=0, 1, 2, \dots, N.
\]
#+end_export
donde
#+begin_export latex
\[
  Y = \sum_{i=1}^{N} y_{i},
\]
#+end_export
es la renta total. De acuerdo con esta definición, es fácil ver que
$L(0)=0$ y $L(1)=1$.

#+NAME: tab-lorenz-ex
#+CAPTION: Cálculo de la curva de Lorenz.
#+ATTR_LATEX:  :options[H]
#+begin_table
#+ATTR_LATEX: :booktabs t :align >{$}r<{$}*{4}{>{$}w{r}{2cm}<{$}}
|           i | y_{i} | y_{i} / @@latex: \sum y_i@@  | p         | L(p)        |
|-------------+-----+---------------------------+-----------+-------------|
|           0 |   0 | \pct{0.0}                 | \pct{0}   | \pct{0.0}   |
|           1 |   3 | \pct{1.9}                 | \pct{10}  | \pct{1.9}   |
|           2 |   7 | \pct{4.5}                 | \pct{20}  | \pct{6.5}   |
|           3 |   8 | \pct{5.2}                 | \pct{30}  | \pct{11.7}  |
|           4 |  10 | \pct{6.5}                 | \pct{40}  | \pct{18.2}  |
|           5 |  12 | \pct{7.8}                 | \pct{50}  | \pct{26.0}  |
|           6 |  14 | \pct{9.1}                 | \pct{60}  | \pct{35.1}  |
|           7 |  17 | \pct{11.0}                | \pct{70}  | \pct{46.1}  |
|           8 |  20 | \pct{13.0}                | \pct{80}  | \pct{59.1}  |
|           9 |  25 | \pct{16.2}                | \pct{90}  | \pct{75.3}  |
|          10 |  38 | \pct{24.7}                | \pct{100} | \pct{100.0} |
|-------------+-----+---------------------------+-----------+-------------|
| \text{Suma} | 154 |                           |           |             |
#+TBLFM: @2$2..@13$2=remote(tab-lorenz-data, @@#$2)
#+TBLFM: @2$3..@12$3='(concat "\\pct{" remote(tab-lorenz-data, @@#$3) "}")
#+TBLFM: @2$4..@12$4='(concat "\\pct{" remote(tab-lorenz-data, @@#$4) "}")
#+TBLFM: @2$3..@12$5='(concat "\\pct{" remote(tab-lorenz-data, @@#$5) "}")
#+end_table

En el Cuadro [[tab-lorenz-ex]], se presenta un ejemplo sencillo para
ilustrar la construcción de la curva de Lorenz. Los datos que aparecen
en esa tabla corresponden a una hipotética economía con 10
habitantes. Las rentas de cada uno de los individuos, $y_i$ para $i =
1, \dots, 10$, se miden en miles de euros al año y aparecen en orden
creciente[fn:1: Se ha incluido una fila adicional correspondiente a $i
= 0$, que representaría un individuo adicional cuya renta es $0$. La
inclusión de este individuo no afecta a los cálculos pero facilita la
representación gráfica posterior.]. La renta total en esta economía es
$Y = \sum y_i = 154$ miles de euros al año. La tercera columna expresa
las rentas individuales como porcentaje de la renta total. Por
ejemplo, la renta del individuo 3 representa el \pct{5.2} de la renta
total de esa economía. Las últimas dos columnas son porcentajes
acumulados de población, $p$, y de renta, $L(p)$. Por ejemplo, en la
fila $i = 6$ el valor de $p$ es \pct{60}, lo que quiere decir que en
las seis primeras filas representan el \pct{60} más pobre de la
población, mientras que $L(p)$ es \pct{35.1}, es decir, esa fracción
de la población solo obtiene el \pct{35.1} de la renta de ese país.

#+NAME: fig-lorenz-ex
#+CAPTION: Curva de Lorenz, $L(p)$: ejemplo.
#+ATTR_LATEX: :options [h!]
#+begin_figure
#+include: "../tex/ineq-fig-lorenz.tex" export latex
#+end_figure

En la Figura [[fig-lorenz-ex]] se representa gráficamente la curva de
Lorenz a partir de las columnas $p$ y $L(p)$ del Cuadro
[[tab-lorenz-ex]]. Además, se representa la línea de 45\textdegree{} que
sería la curva de Lorenz correspondiente a una distribución de la
renta completamente igualitaria. Si todos los individuos dispusieran
de la misma renta, se cumpliría que $L(p) = p$ para cualquier
proporción $p$. Es decir, el 30% de la población más pobre obtendría
exactamente el 30% de la renta total, el 50% de la población obtendría
el 50% de la renta, y así sucesivamente. Cuando la renta no se
distribuye de forma perfectamente igualitaria la curva de Lorenz está
por debajo de la línea de 45\textdegree{}, indicando que la población
más pobre obtiene una proporción de la renta total inferior a su
proporción demográfica.  La diagonal se toma como referencia a la hora
de evaluar una determinada distribución de la renta: cuanto más cerca
esté la curva de Lorenz a la recta de 45\textdegree{}, menor es la
desigualdad.

#+NAME: fig-lorenz-comp1
#+CAPTION: Comparación de dos curvas de Lorenz. La distribución representada por  $L_A(p)$ es más igualitaria que la correspondiente a $L_B(p)$.
#+ATTR_LATEX: :options [h!]
#+begin_figure
#+include: "../tex/ineq-fig-lorenz-comp1.tex" export latex
#+begin_export latex
#+end_export
#+end_figure

#+NAME: fig-lorenz-comp2
#+CAPTION: Comparación de dos curvas de Lorenz. Cuando las curvas de Lorenz se cortan ninguna de las dos distribuciones es uniformemente más igualitaria que la otra.
#+ATTR_LATEX: :options [h!]
#+begin_figure
#+include: "../tex/ineq-fig-lorenz-comp2.tex" export latex
#+end_figure

En las Figuras [[fig-lorenz-comp1]] y [[fig-lorenz-comp2]] se representan las
curvas de Lorenz correspondiente a dos distribuciones de la renta, con
el objeto de determinar cuál es la distribución más igualitaria en
cada caso.

- En la Figura [[fig-lorenz-comp1]], la curva de Lorenz de A se encuentra
  siempre por encima de la de B (es decir, está más cerca de la línea
  de 45° en todo su recorrido). En este caso se dice que A domina en
  el sentido de Lorenz a B, y la comparación no presenta ambigüedad: A
  tiene menor desigualdad que B en toda la distribución. En casos como
  este, es posible mostrar que, a igualdad de rentas medias, las
  distribuciones más igualitarias se corresponden a niveles de
  bienestar social más elevados sea cual sea la función de bienestar
  social que se utilice (mientras sea simétrica y cóncava).

- En casos como el de la Figura [[fig-lorenz-comp2]], en que las curvas de
  Lorenz se cruzan en algún punto, ninguna de las distribuciones de la
  renta es uniformemente más igualitaria que la otra. En la Figura
  [[fig-lorenz-comp2]] la distribución de la renta de A es más igualitaria
  que B en los segmentos más pobres de la población pero menos
  igualitaria que en los más ricos. En tal situación, no es posible
  ordenar las distribuciones de menor a mayor desigualdad.



